Revit 2027 API
PlanViewRange.SetOffset Method
 Set the offset value associated with a View Depth plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOffset(
	PlanViewPlane planViewPlane,
	double offset
)
Public Sub SetOffset (
	planViewPlane As PlanViewPlane,
	offset As Double
)
public:
void SetOffset(
	PlanViewPlane planViewPlane,
	double offset
)
member SetOffset :
        planViewPlane : PlanViewPlane *
        offset : float -> unit
Parameters
planViewPlane PlanViewPlane
 View Depth plane
offset Double
 Offset value
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PlanViewRange Class
Autodesk.Revit.DB Namespace